src/bsl/Documents/гкс_НаправлениеНаРазгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>гкс_НаправлениеНаРазгрузку</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СостоянияРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятьКачество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯмаРазгрузки</Name>
					<Comment>ERP-1094</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебнаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеМестаРазгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Силос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СлужебнаяНоменклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическаяРазгрузка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯмаРазгрузки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_ОстаткиТочекМаршрутаMFM.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ОстаткиТочекМаршрутаMFM</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_СРПВСтатусыОформленияВагонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_СРПВСтатусыОформленияВагонов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_Взвешивание</v8:Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерВагона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.гкс_НомерВагона</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОперации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КлючАналитикиСРПВ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_КлючиАналитикиСРПВ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.гкс_ДокументыСРПВ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СРПВСтатусыВагонов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_СоответствияОбъектовСРПВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_СоответствияОбъектовСРПВ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.гкс_ИнтеграцияСРПВСправочники</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипОбъектаСРПВ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыОбъектовСРПВ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСРПВ</Name>
					<Comment>Идентификатор объекта СРПВ</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.гкс_ИдентификаторыСРПВ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/Enums/гкс_ТипРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипРегистрации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приемка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_СостоянияРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_СостоянияРегистрации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прибыл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзвешенБрутто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринятоПоПревышениюМаксимальногоВеса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регистрация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтборуПроб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзятыПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатыПробПолучены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоНеПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаРазрешена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзвешенТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Убыл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятыПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогрузкаРазрешена</Name>
					<Comment>ERP-2029</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погружен</Name>
					<Comment>ERP-2029</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_ТипыТранспортныхСредствДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипыТранспортныхСредствДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Судно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖДТранспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Самолёт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Трубопровод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контейнер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_СРПВСтатусыВагонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_СРПВСтатусыВагонов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прибыл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзвешенБрутто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзвешенТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погружен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_ТипыОбъектовСРПВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипыОбъектовСРПВ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПЛК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Весы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтруктураПЛК</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Documents/гкс_НаправлениеНаРазгрузку/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт

	МеханизмыДокумента.Добавить("ПриемкаПЛК");

КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка - ссылка на документ, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  Структура - коллекция элементов:
//     * Таблица<ИмяРегистра> - ТаблицаЗначений - таблица данных для отражения в регистр.
//
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт

	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = гкс_ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;

	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;

	Если НЕ ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		ЗаполнитьПараметрыИнициализации(Запрос, Документ, ДопПараметры);
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		ТекстЗапросаТаблицаСостояниеРегистрации(ТекстыЗапроса, Регистры);
	КонецЕсли;

	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений

	Возврат гкс_ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);

КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ТочкаМаршрута)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Создать и заполнить Направление на разгрузку.
//
// Параметры:
//  ДанныеЗаполнения - Структура - имена ключей должны совпадать с именами заполняемых реквизитов документа.
//
// Возвращаемое значение:
//  Неопределено, ДокументСсылка.гкс_НаправлениеНаРазгрузку - ссылка на созданый документ
//															  или Неопределено, если документ не удалось записать.
Функция СоздатьДокументНаОсновании(ДанныеЗаполнения) Экспорт

	НовыйДокумент = СоздатьДокумент();
	НовыйДокумент.Заполнить(ДанныеЗаполнения);

	Попытка
		ЗаписатьНаправлениеНаРазгрузку(НовыйДокумент);
		Результат = НовыйДокумент.Ссылка;
	Исключение

		ТекстСообщения = НСтр("ru='При формировании направленияна рагрузку возникли ошибки.
							  |Подробности в журнале регистрации'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

		ЗаписьЖурналаРегистрации("НаправлениеНаРазгрузку.Проведение", УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.гкс_НаправлениеНаРазгрузку,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(
			ИнформацияОбОшибке()));

		Результат = Неопределено;
	КонецПопытки;

	Возврат Результат;

КонецФункции

// Создать/Изменить Направление на разгрузку из АРМ Приемки.
//
// Параметры:
//  ДанныеЗаполнения - Структура
//  ДокументСуществует - Булево
//  ДокументНазначение - ДокументСсылка.гкс_НаправлениеНаРазгрузку
//
Процедура СоздатьИзменитьИзАРМПриемки(ДанныеЗаполнения, ДокументСуществует = Ложь, ДокументНазначение = Неопределено) Экспорт

	Если ДокументСуществует Тогда
		НовыйДокумент = ДокументНазначение.ПолучитьОбъект();
	Иначе
		НовыйДокумент = СоздатьДокумент();
	КонецЕсли;

	НовыйДокумент.Заполнить(ДанныеЗаполнения);
	Если ДанныеЗаполнения.Свойство("НеРегистрироватьДляПередачиСРПВ") Тогда
		НовыйДокумент.ДополнительныеСвойства.Вставить("НеРегистрироватьДляПередачиСРПВ");
	КонецЕсли;

	Попытка
		ЗаписатьНаправлениеНаРазгрузку(НовыйДокумент);
	Исключение
		НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;

КонецПроцедуры

// Получить по регистрации.
//
// Параметры:
//  Регистрация - ДокументСсылка.гкс_РегистрацияНаПЛК -
//
// Возвращаемое значение:
//  ДокументСсылка.гкс_НаправлениеНаРазгрузку
//
Функция ПолучитьПоРегистрации(Регистрация) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НаправлениеНаРазгрузку.Ссылка КАК НаправлениеНаРагрузку
	|ИЗ
	|	Документ.гкс_НаправлениеНаРазгрузку КАК НаправлениеНаРазгрузку
	|ГДЕ
	|	НаправлениеНаРазгрузку.ДокументРегистрации = &Регистрация";

	Запрос.УстановитьПараметр("Регистрация", Регистрация);

	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.НаправлениеНаРагрузку;
	Иначе
		Результат = Неопределено;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Получить по регистрациям.
//
// Параметры:
//  Регистрации - Массив из ДокументСсылка.гкс_РегистрацияНаПЛК -
//
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция ПолучитьПоРегистрациям(Регистрации) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегистрацияНаПЛК.Ссылка КАК ДокументРегистрации,
	|	ЕСТЬNULL(НаправлениеНаРазгрузку.Ссылка, ЗНАЧЕНИЕ(Документ.гкс_НаправлениеНаРазгрузку.ПустаяСсылка)) КАК НаправлениеНаРагрузку
	|ИЗ
	|	Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_НаправлениеНаРазгрузку КАК НаправлениеНаРазгрузку
	|		ПО РегистрацияНаПЛК.Ссылка = НаправлениеНаРазгрузку.ДокументРегистрации
	|ГДЕ
	|	РегистрацияНаПЛК.Ссылка В (&Регистрации)";

	Запрос.УстановитьПараметр("Регистрации", Регистрации);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Метод готовит структуру сообщения с доступными местами выгрузки для отправки СРПВ.
//
// Параметры:
//  Ссылка - ДокументСсылка.гкс_НаправлениеНаРазгрузку - источник получения данных.
//
// Возвращаемое значение:
//  Неопределено, Структура - Данные мест выгрузки для отправки СРПВ:
// * ID_PLK - Число, Неопределено - Идентификатор СРПВ для Текущего ПЛК
// * messageId - Строка - уникальный идентификатор события
// * revoked - Булево - "разрешение отозвано": Истина если документ не проведен
// * waggonNumber - Строка - Номер вагона
// * waggonDispatchId - Число - Идентификатор отправки вагона
// * creationDateTime - Дата - Универсальное время по текущей дате сеанса
// * railways - Массив из Структура - коллекция доступных идентификаторов ЖД путей
Функция МестаВыгрузкиДляОтправкиСРПВ(Ссылка) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	ДанныеДокумента = ДанныеДокументаСАналитикойСРПВ(Ссылка);
	Если ДанныеДокумента = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	МестаРазгрузки = МестаРазгрузкиСАналитикойСРПВ(Ссылка);
	Если МестаРазгрузки = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	СтрокиОшибок = Новый Массив;

	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("ID_PLK"			, гкс_ИнтеграцияСРПВПовтИсп.ИдентификаторТекущегоПЛК());
	СтруктураСообщения.Вставить("messageId"			, Строка(Новый УникальныйИдентификатор()));
	СтруктураСообщения.Вставить("revoked"			, Не ДанныеДокумента.Проведен);
	СтруктураСообщения.Вставить("waggonNumber"		, ДанныеДокумента.НомерВагона);
	СтруктураСообщения.Вставить("waggonDispatchId"	, ДанныеДокумента.ИдентификаторОтправкиВагона);
	СтруктураСообщения.Вставить("creationDateTime"	, УниверсальноеВремя(ТекущаяДатаСеанса()));
	СтруктураСообщения.Вставить("railways"			, Новый Массив);

	Для Каждого МестоРазгрузки Из МестаРазгрузки Цикл

		Если Не ЗначениеЗаполнено(МестоРазгрузки.ЖДПуть) Тогда
			СтрокиОшибок.Добавить(
				СтрШаблон("В структуре ПЛК не найден путь для ямы %1.", МестоРазгрузки.ЯмаРазгрузки));
		ИначеЕсли Не ЗначениеЗаполнено(МестоРазгрузки.ЖДПутьИдентификаторСРПВ) Тогда
			СтрокиОшибок.Добавить(
				СтрШаблон("Для ЖД пути %1 не назначен идектификатор СРПВ.", МестоРазгрузки.ЖДПуть));
		Иначе

			СвойстваПути = Новый Структура;
			СвойстваПути.Вставить("railwayId"	, МестоРазгрузки.ЖДПутьИдентификаторСРПВ);
			СвойстваПути.Вставить("railwayName"	, МестоРазгрузки.ЖДПутьНаименование);
			СтруктураСообщения.railways.Добавить(СвойстваПути);

		КонецЕсли;

	КонецЦикла;

	Если СтрокиОшибок.Количество() Тогда

		СтруктураСообщения = Неопределено;
		СтрокиОшибок.Вставить(0, "Не удалось подготовить сообщения для передачи в СРПВ!");
		СообщениеОбОшибке = СтрСоединить(СтрокиОшибок, Символы.ПС);
		ЗаписьЖурналаРегистрации("Интеграция СРПВ. Подготовка сообщений",
			УровеньЖурналаРегистрации.Ошибка, Ссылка.Метаданные(), Ссылка, СообщениеОбОшибке);
		ОбщегоНазначения.СообщитьПользователю(СообщениеОбОшибке);

	КонецЕсли;

	Возврат СтруктураСообщения;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Процедура ЗаписатьНаправлениеНаРазгрузку(НовыйДокумент)

	ВесНетто = гкс_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовыйДокумент.ДокументРегистрации, "ВесНетто");
	КгВТоннах = 1000;
	ВесНеттоТонн = ВесНетто/КгВТоннах;
	ЗаписатьДокумент = РегистрыСведений.гкс_ОстаткиТочекМаршрутаMFM.ТочкаМаршрутаПереполнена(
		НовыйДокумент.Склад, ВесНеттоТонн);

	Если ЗаписатьДокумент Тогда
		НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
	Иначе
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДопПараметры)

	МенеджерВременныхТаблиц = Неопределено;

	Если ДопПараметры <> Неопределено
		И ДопПараметры.Свойство("МенеджерВременныхТаблиц", МенеджерВременныхТаблиц) Тогда

		МенеджерВременныхТаблиц = ?(МенеджерВременныхТаблиц = Неопределено,
									Новый МенеджерВременныхТаблиц,
									МенеджерВременныхТаблиц);

	Иначе
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;

	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());

КонецПроцедуры

Функция ТекстЗапросаТаблицаСостояниеРегистрации(ТекстыЗапроса, Регистры)

	ИмяРегистра = "гкс_СостоянияРегистрации";

	Если НЕ гкс_ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НаправлениеНаРазгрузку.Дата КАК Период,
	|	НаправлениеНаРазгрузку.ТочкаМаршрута КАК ТочкаМаршрута,
	|	НаправлениеНаРазгрузку.Ссылка КАК Регистратор,
	|	НаправлениеНаРазгрузку.ДокументРегистрации КАК ДокументРегистрации,
	|	&Пользователь КАК Пользователь,
	|	Регистрация.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ВЫБОР
	|		КОГДА Регистрация.ТипРегистрации = ЗНАЧЕНИЕ(Перечисление.гкс_ТипРегистрации.Приемка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияРегистрации.ВыгрузкаРазрешена)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияРегистрации.ПогрузкаРазрешена)
	|	КОНЕЦ КАК Состояние,
	|	Регистрация.ТипРегистрации КАК ТипРегистрации,
	|	Регистрация.ВидПеревозки КАК ВидПеревозки,
	|	НаправлениеНаРазгрузку.Комментарий КАК Комментарий,
	|	НаправлениеНаРазгрузку.МестнаяДата КАК МестнаяДата
	|ИЗ
	|	Документ.гкс_НаправлениеНаРазгрузку КАК НаправлениеНаРазгрузку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК Регистрация
	|		ПО НаправлениеНаРазгрузку.ДокументРегистрации = Регистрация.Ссылка
	|ГДЕ
	|	НаправлениеНаРазгрузку.Ссылка = &Ссылка";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#Область Отчеты

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт

	ВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);

КонецПроцедуры

#КонецОбласти

#Область СРПВ

Функция ДанныеДокументаСАналитикойСРПВ(Ссылка)

	ДанныеДокумента = Неопределено;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументНаправлениеНаРазгрузку.Ссылка КАК НаправлениеНаРазгрузку,
	|	ДокументНаправлениеНаРазгрузку.Проведен КАК НаправлениеНаРазгрузкуПроведен,
	|	ДокументРегистрацияНаПЛК.Ссылка КАК РегистрацияНаПЛК
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	Документ.гкс_НаправлениеНаРазгрузку КАК ДокументНаправлениеНаРазгрузку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК ДокументРегистрацияНаПЛК
	|		ПО ДокументНаправлениеНаРазгрузку.ДокументРегистрации = ДокументРегистрацияНаПЛК.Ссылка
	|		И ДокументНаправлениеНаРазгрузку.Ссылка = &Ссылка
	|		И ДокументРегистрацияНаПЛК.ВидПеревозки = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.НаправлениеНаРазгрузку КАК НаправлениеНаРазгрузку,
	|	ДанныеДокумента.НаправлениеНаРазгрузкуПроведен КАК Проведен,
	|	СРПВСтатусыОформленияВагонов.КлючАналитикиСРПВ КАК КлючАналитикиСРПВ,
	|	СРПВСтатусыОформленияВагонов.КлючАналитикиСРПВ.НомерВагона КАК НомерВагона,
	|	СРПВСтатусыОформленияВагонов.КлючАналитикиСРПВ.ИдентификаторОтправкиВагона КАК ИдентификаторОтправкиВагона
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СРПВСтатусыОформленияВагонов КАК СРПВСтатусыОформленияВагонов
	|		ПО ДанныеДокумента.РегистрацияНаПЛК = СРПВСтатусыОформленияВагонов.Документ
	|		И СРПВСтатусыОформленияВагонов.Статус = ЗНАЧЕНИЕ(Перечисление.гкс_СРПВСтатусыВагонов.Прибыл)";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выгрузить();
		ДанныеДокумента = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка[0]);
	КонецЕсли;

	Возврат ДанныеДокумента;

КонецФункции

Функция МестаРазгрузкиСАналитикойСРПВ(Ссылка)

	МестаРазгрузки = Неопределено;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДоступныеМестаРазгрузки.ЯмаРазгрузки КАК ЯмаРазгрузки,
	|	ЕСТЬNULL(СтруктураПЛК.Ссылка, НЕОПРЕДЕЛЕНО) КАК ЖДПуть
	|ПОМЕСТИТЬ ДоступныеМестаРазгрузки
	|ИЗ
	|	Документ.гкс_НаправлениеНаРазгрузку.ДоступныеМестаРазгрузки КАК ДоступныеМестаРазгрузки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_СтруктураПЛК КАК СтруктураПЛК
	|		ПО ДоступныеМестаРазгрузки.ЯмаРазгрузки = СтруктураПЛК.ТочкаМаршрута
	|		И НЕ СтруктураПЛК.ПометкаУдаления
	|ГДЕ
	|	ДоступныеМестаРазгрузки.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоступныеМестаРазгрузки.ЯмаРазгрузки КАК ЯмаРазгрузки,
	|	ДоступныеМестаРазгрузки.ЖДПуть КАК ЖДПуть,
	|	ДоступныеМестаРазгрузки.ЖДПуть.Наименование КАК ЖДПутьНаименование,
	|	ЕСТЬNULL(СоответствияОбъектовСРПВ.ИдентификаторСРПВ, НЕОПРЕДЕЛЕНО) КАК ЖДПутьИдентификаторСРПВ
	|ИЗ
	|	ДоступныеМестаРазгрузки КАК ДоступныеМестаРазгрузки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СоответствияОбъектовСРПВ КАК СоответствияОбъектовСРПВ
	|		ПО ДоступныеМестаРазгрузки.ЖДПуть = СоответствияОбъектовСРПВ.Ссылка
	|		И СоответствияОбъектовСРПВ.ТипОбъектаСРПВ = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыОбъектовСРПВ.СтруктураПЛК)";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выгрузить();
		МестаРазгрузки = ОбщегоНазначения.ТаблицаЗначенийВМассив(Выборка);
	КонецЕсли;

	Возврат МестаРазгрузки;

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
